DataProcessors/isc_РаботаСУстройством.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>isc_РаботаСУстройством</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>HistoriOfScaning</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Status</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Barcode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Length</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Width</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Height</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Weight</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ratio</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/isc_МетодХраненияВГХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>isc_МетодХраненияВГХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеквизитыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыУпаковки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРеквизитыХарактеристики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияХарактеристики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОбъектаХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/isc_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>isc_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыХранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодХраненияВГХ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.isc_МетодХраненияВГХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство_ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствиеУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдУпаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/isc_РаботаСУстройством/Forms/ФормаНастройки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СткНастройки = Справочники.isc_Настройки.ПолучитьНастройки();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СткНастройки,,"МетодыХранения,СоответствиеУпаковок");
	ЭтаФорма.МетодыХранения.Загрузить(СткНастройки.МетодыХранения);
	ЭтаФорма.СоответствиеУпаковок.Загрузить(СткНастройки.СоответствиеУпаковок);	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере() 

	СткНастройки = Новый Структура("АдресУстройства,Логин,Пароль,Порт,Логирование,МетодыХранения,СоответствиеУпаковок");
	ЗаполнитьЗначенияСвойств(СткНастройки, ЭтаФорма);
	Справочники.isc_Настройки.СохранитьНастройки(сткНастройки);
	//Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	//Если Не ЗНачениеЗаполнено(Настройки) Тогда
	//	Настройки = Справочники.isc_Настройки.СоздатьЭлемент();
	//	Настройки.Код = "000000001";
	//Иначе
	//	Настройки = Настройки.ПолучитьОбъект();
	//КонецЕсли;	
	//	ЗаполнитьЗначенияСвойств(Настройки, СткНастройки);
	//	Настройки.МетодыХранения.Загрузить(ЭтаФорма.МетодыХранения.Выгрузить());
	//	Настройки.СоответствиеУпаковок.Загрузить(ЭтаФорма.СоответствиеУпаковок.Выгрузить());
	//    Настройки.Записать();
	//Сообщить("Настройки сохранены!");
КонецПроцедуры


&НаКлиенте
Процедура ТестСоединения(Команда)
	УспешноПодключились = УстановитьСоединенияНаСервере();
	Если УспешноПодключились Тогда
		ПоказатьОповещениеПользователя("Успешно!",,"Успешно подключение к устройству.", БиблиотекаКартинок.ДиалогИнформация);	
	Иначе
		ПоказатьОповещениеПользователя("Ошибка подключения",,"Не удалось установить подключение к оборудованию. Проверьте настройки.", БиблиотекаКартинок.ДиалогВосклицание);
	КонецЕсли;
КонецПроцедуры

Функция УстановитьСоединенияНаСервере(ТестСоединения = Истина, ЧитатьИсторию = Ложь)
	Возврат Справочники.isc_Настройки.УстановитьСоединениеНаСервере(ТестСоединения, ЧитатьИсторию);
	//СткНастройки = Справочники.isc_Настройки.ПолучитьНастройкиУстройства();
	//Если ЧитатьИсторию Тогда
	//	СтраницаСервера	  = "/history";
	//Иначе         
	//	СтраницаСервера = "/data";
	//КонецЕсли;
	//
	//Соединение = Новый HTTPСоединение(
	//СткНастройки.АдресУстройства, //"89.175.58.20", // сервер (хост)
	//СткНастройки.Порт, //60080, // порт, по умолчанию для http используется 80, для https 443
	//СткНастройки.Логин,  //"user", // пользователь для доступа к серверу (если он есть)
	//СткНастройки.Пароль, //"user", // пароль для доступа к серверу (если он есть)
	//, // здесь указывается прокси, если он есть
	//, // таймаут в секундах, 0 или пусто - не устанавливать
	//Новый  ЗащищенноеСоединениеOpenSSL()// защищенное соединение, если используется https
	//);
	//Запрос = Новый HTTPЗапрос(СтраницаСервера);//"/data");
	//Попытка
	//	Результат = Соединение.Получить(Запрос);
	//Исключение
	//	Возврат Ложь;	
	//КонецПопытки;	
	//Возврат ?(ТестСоединения, Результат.КодСостояния = 200 ,Результат.ПолучитьТелоКакПоток());	
КонецФункции

&НаСервере
Процедура МетодыХраниенияМетодХраненияВГХПриИзмененииНаСервере(МетодХраненияВГХ, Примечание, Свойство)
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
		
	Если МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыУпаковки  ИЛИ МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыНоменклатуры Тогда		
		Примечание = "Укажите реквизит";
	Иначе
		Примечание = "Укажите свойство";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура МетодыХраниенияМетодХраненияВГХПриИзменении(Элемент)
	Примечание = "";
	Свойство = Неопределено;
	МетодыХраниенияМетодХраненияВГХПриИзмененииНаСервере(Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ,Примечание, Свойство);
	Элементы.МетодыХранения.ТекущиеДанные.Примечание = Примечание;
    //Элементы.МетодыХранения.ТекущиеДанные.Свойство_ИмяРеквизита = Свойство;
КонецПроцедуры

&НаСервере
Процедура МетодыХраниенияСвойствоПриИзмененииНаСервере(МетодХраненияВГХ, Примечание)
	
	Если МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыНоменклатуры   Тогда
		Примечание = "Габарит будет записываться в доп реквизит номенклатуры.";
	ИначеЕсли МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопРеквизитыХарактеристики Тогда
		Примечание = "Габарит будет записываться в доп. реквизит характеристики.";  
	ИначеЕсли МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияНоменклатуры Тогда
		Примечание = "Габарит будет записываться в регистр доп.сведение номенклатуры.";
	ИначеЕсли МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.ДопСведенияХарактеристики Тогда
		Примечание = "Габарит будет записываться в регистр доп.сведение характеристики.";
	ИначеЕсли МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыУпаковки Тогда		
		Примечание = "Габарит будет записываться в указанный реквизит справочника Упаковки";
	ИначеЕсли МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыНоменклатуры Тогда		
		Примечание = "Габарит будет записываться в указанный реквизит справочника Номенклатура";
	ИначеЕсли МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыОбъектаХранения Тогда		
		Примечание = "Габарит будет записываться в указанный реквизит справочника ОбъектыХранения";
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура МетодыХраниенияСвойствоПриИзменении(Элемент) 
	
КонецПроцедуры

&НаКлиенте
Процедура МетодыХраниенияСвойствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		Примечание = "";
	Если Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ = ПредопределенноеЗначение("Перечисление.isc_МетодХраненияВГХ.РеквизитыУпаковки")  ИЛИ Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ = ПредопределенноеЗначение("Перечисление.isc_МетодХраненияВГХ.РеквизитыНоменклатуры") Тогда	
		сзРеквизитов = Новый СписокЗначений;
		сзРеквизитов = ПолучитьсзРеквизитов(Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ);
		ВыбЭлемент = сзРеквизитов.ВыбратьЭлемент("Укажите реквизит в котором хранится измерение."); 
		Элементы.МетодыХранения.ТекущиеДанные.Примечание = "Измерение будет записано в указанный реквизит";
		Если НЕ ВыбЭлемент = Неопределено Тогда
			Элементы.МетодыХранения.ТекущиеДанные.Свойство_ИмяРеквизита = ВыбЭлемент.Значение;
        КонецЕсли;
	Иначе
        Свойство = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка");//Элементы.МетодыХранения.ТекущиеДанные.Свойство_ИмяРеквизита;
		ВвестиЗначение(Свойство);
		МетодыХраниенияСвойствоПриИзмененииНаСервере(Элементы.МетодыХранения.ТекущиеДанные.МетодХраненияВГХ, Примечание);
   		Элементы.МетодыХранения.ТекущиеДанные.Примечание = Примечание;
   		Элементы.МетодыХранения.ТекущиеДанные.Свойство_ИмяРеквизита = Свойство;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Функция ПолучитьсзРеквизитов(МетодХраненияВГХ)
	сзРеквизиты = НОвый СписокЗначений; 
	Если МетодХраненияВГХ = Перечисления.isc_МетодХраненияВГХ.РеквизитыУпаковки Тогда
		ТипРеквизита = Тип("СправочникСсылка.Упаковки");                                                               
	Иначе
		ТипРеквизита = Тип("СправочникСсылка.ОбъектХранения");
	КонецЕсли;
	Для Каждого элем Из Метаданные.НайтиПоТипу(ТипРеквизита).Реквизиты Цикл
		сзРеквизиты.Добавить(элем.Имя, Элем.Синоним);
	КонецЦикла;
	Возврат сзРеквизиты;
КонецФункции	

&НаКлиенте
Процедура СоответствиеУпаковокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	т = 1;
КонецПроцедуры

&НаКлиенте
Процедура ЛогСобытий(Команда)
	ОткрытьФорму("РегистрСведений.isc_ЛогСобытий.ФормаСписка");
КонецПроцедуры
